<b>SQL Исследование данных об инвестиции венчурных фондов в компании-стартапы</b><br>
Задачи проекта<br>
Проанализировать данные о фондах и инвестициях и произвести различные выгрузки данных и ответить на вопросы с помощью SQL.<br>

Описание проекта<br>
В данном проекте осуществляется работа с базой данных, которая хранит информацию о венчурных фондах и инвестициях в компании-стартапы. Эта база данных основана на датасете Startup Investments, опубликованном на популярной платформе для соревнований по исследованию данных Kaggle. Целью работы является написание запросов на языке SQL, удовлетворяющих условию конкретной задачи.<br>

Навыки и инструменты<br>
SQL, PostgreSQL

ознакомиться со схемой базы данных можно здесь: https://disk.yandex.ru/i/8FcDuDluyqkzJg

In [ ]:
#Посчитайте, сколько компаний закрылось.
'''
SELECT COUNT(id)
FROM company
WHERE status = 'closed';
'''

In [ ]:
#Отобразите количество привлечённых средств для новостных компаний США. Используйте данные 
#из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total
'''
SELECT funding_total
FROM company
WHERE country_code = 'USA' AND category_code = 'news'
ORDER BY funding_total DESC;

'''

In [ ]:
#Найдите общую сумму сделок по покупке одних компаний другими в долларах. 
#Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.
'''
SELECT SUM(price_amount)
FROM acquisition 
WHERE term_code='cash' AND CAST(acquired_at AS date) BETWEEN '01-01-2011' AND '31-12-2013';
'''

In [ ]:
#Отобразите имя, фамилию и названия аккаунтов людей в твиттере, у которых названия аккаунтов начинаются на 'Silver'

'''
SELECT first_name,
       last_name,
       twitter_username
FROM people
WHERE twitter_username LIKE 'Silver%';


'''

In [ ]:
#Выведите на экран всю информацию о людях, 
#у которых названия аккаунтов в твиттере содержат подстроку 'money', а фамилия начинается на 'K'
'''
SELECT * 
FROM people
WHERE twitter_username LIKE '%money%' AND last_name LIKE 'K%';

'''

In [ ]:
#Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. 
#Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы
'''
SELECT SUM(funding_total),
       country_code
FROM company
GROUP BY country_code
ORDER BY SUM(funding_total) DESC;

'''

In [ ]:
#Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, 
#привлечённых в эту дату.
#Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю 
#и не равно максимальному значению.
'''

SELECT funded_at,
       MAX(raised_amount),
       MIN(raised_amount)
FROM funding_round
GROUP BY funded_at
HAVING MIN(raised_amount) <> 0 AND MIN(raised_amount) <> MAX(raised_amount);


'''

In [ ]:
#Создайте поле с категориями:
#Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
#Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
#Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.
#Отобразите все поля таблицы fund и новое поле с категориями.

'''
SELECT * ,
      CASE 
          WHEN invested_companies >=100 THEN 'high_activity'
          WHEN invested_companies >=20 AND invested_companies<100 THEN 'middle_activity'
          WHEN invested_companies <20 THEN 'low_activity'
      END
FROM fund;

'''

In [ ]:
#Для каждой из категорий, назначенных в предыдущем задании, 
#посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, 
#в которых фонд принимал участие. Выведите на экран категории и среднее число инвестиционных раундов. 
#Отсортируйте таблицу по возрастанию среднего.

'''
SELECT 
       CASE
           WHEN invested_companies>=100 THEN 'high_activity'
           WHEN invested_companies>=20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity,
       ROUND(AVG(investment_rounds))
FROM fund
GROUP BY activity
ORDER BY ROUND(AVG(investment_rounds));

'''

In [ ]:
#Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 
#Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны,
#основанные с 2010 по 2012 год включительно. Исключите страны с фондами, 
#у которых минимальное число компаний, получивших инвестиции, равно нулю. 
#Выгрузите десять самых активных стран-инвесторов: отсортируйте таблицу по среднему количеству компаний от большего к меньшему. 
#Затем добавьте сортировку по коду страны в лексикографическом порядке.

'''

SELECT MIN(invested_companies),
       MAX(invested_companies),
       AVG(invested_companies),
       country_code
FROM fund
WHERE (CAST(founded_at AS date) BETWEEN '01-01-2010' AND '31-12-2012')
GROUP BY country_code
HAVING MIN(invested_companies) <>0
ORDER BY AVG(invested_companies) DESC,country_code
LIMIT 10;

'''

In [ ]:

#Отобразите имя и фамилию всех сотрудников стартапов.
#Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

'''

SELECT p.first_name,
        p.last_name,
        ed.instituition
FROM people AS p
LEFT JOIN education AS ed ON p.id = ed.person_id

'''

In [ ]:
#Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. 
#Выведите название компании и число уникальных названий учебных заведений. 
#Составьте топ-5 компаний по количеству университетов.


'''
SELECT c.name,
       COUNT( DISTINCT ed.instituition)
FROM company AS c
JOIN people AS pe ON c.id =pe.company_id
JOIN education AS ed ON pe.id = ed.person_id
GROUP BY c.name
order by count(distinct instituition) desc
LIMIT 5;

'''

In [ ]:
#Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

'''
SELECT DISTINCT c.name
FROM company AS c
JOIN funding_round AS fr ON fr.company_id = c.id
WHERE c.status = 'closed'
AND (is_first_round = 1 AND is_last_round = 1);

'''

In [ ]:
#Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

'''
SELECT DISTINCT p.id
FROM people AS p
JOIN company AS c ON c.id = p.company_id
JOIN funding_round AS fr ON fr.company_id = c.id

WHERE c.status = 'closed'
AND (is_first_round = 1 AND is_last_round = 1)

'''

In [ ]:
#Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением,
#которое окончил сотрудник

'''
SELECT DISTINCT p.id,
       ed.instituition
FROM people AS p
JOIN company AS c ON c.id = p.company_id
JOIN funding_round AS fr ON fr.company_id = c.id
JOIN education AS ed ON ed.person_id = p.id
WHERE c.status = 'closed'
AND (is_first_round = 1 AND is_last_round = 1)

'''

In [ ]:
#Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. 
#При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды

'''
WITH 
fr AS
  (SELECT *
   FROM funding_round
   WHERE is_first_round =1
     AND is_first_round = is_last_round),
l AS
  (SELECT c.name,
          c.id
   FROM company AS c
   INNER JOIN fr ON c.id=fr.company_id
   WHERE status like '%closed%'
   GROUP BY c.name,
            c.id),
q AS
  (SELECT p.id
   FROM people AS p
   INNER JOIN l ON l.id=p.company_id
   GROUP BY p.id),
 
 
w AS (SELECT DISTINCT e.person_id
  
FROM education AS e
INNER JOIN q ON q.id=e.person_id
GROUP BY e.person_id)
 
select w.person_id,
        count(e.instituition)
from w 
join education as e on w.person_id=e.person_id

group by w.person_id

'''

In [ ]:
#Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), 
#которые окончили сотрудники разных компаний. 
#Нужно вывести только одну запись, группировка здесь не понадобится.

'''

WITH base AS
(SELECT p.id,
COUNT(e.instituition)
FROM people AS p
LEFT JOIN education AS e ON p.id = e.person_id
WHERE p.company_id IN
(SELECT c.id
FROM company AS c
JOIN funding_round AS fr ON c.id = fr.company_id
WHERE STATUS ='closed'
AND is_first_round = 1
AND is_last_round = 1
GROUP BY c.id)
GROUP BY p.id
HAVING COUNT(DISTINCT e.instituition) >0)
SELECT AVG(COUNT)
FROM base;

'''

In [ ]:
#Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), 
#которые окончили сотрудники Facebook*.
#*(сервис, запрещённый на территории РФ)

'''
WITH base AS 
(SELECT p.id,
COUNT(e.instituition)
FROM people AS p
RIGHT JOIN education AS e ON p.id = e.person_id
WHERE p.company_id IN
(SELECT id
FROM company
WHERE name = 'Facebook')
GROUP BY p.id)
SELECT AVG(COUNT)
FROM base;

'''

In [ ]:
#Составьте таблицу из полей:
#name_of_fund — название фонда;
#name_of_company — название компании;
#amount — сумма инвестиций, которую привлекла компания в раунде.
#В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, 
#а раунды финансирования проходили с 2012 по 2013 год включительно.

'''
SELECT f.name AS name_of_fund,
c.name AS name_of_company,
fr.raised_amount AS amount
FROM investment AS i
LEFT JOIN company AS c ON c.id = i.company_id
LEFT JOIN fund AS f ON i.fund_id = f.id
INNER JOIN 
(SELECT*
FROM funding_round
WHERE funded_at BETWEEN '2012-01-01' AND '2013-12-31')
AS fr ON fr.id = i.funding_round_id
WHERE c.milestones > 6;


'''

In [ ]:
#Выгрузите таблицу, в которой будут такие поля:
#название компании-покупателя;
#сумма сделки;
#название компании, которую купили;
#сумма инвестиций, вложенных в купленную компанию;
#доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, 
#округлённая до ближайшего целого числа.
#Не учитывайте те сделки, в которых сумма покупки равна нулю. 
#Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 
#Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке.
#Ограничьте таблицу первыми десятью записями.

'''
WITH acquiring AS
(SELECT c.name AS buyer,
a.price_amount AS price,
a.id AS KEY
FROM acquisition AS a
LEFT JOIN company AS c ON a.acquiring_company_id = c.id
WHERE a.price_amount > 0),
acquired AS
(SELECT c.name AS acquisition,
c.funding_total AS investment,
a.id AS KEY
FROM acquisition AS a
LEFT JOIN company AS c ON a.acquired_company_id = c.id
WHERE c.funding_total > 0)
SELECT acqn.buyer,
acqn.price,
acqd.acquisition,
acqd.investment,
ROUND(acqn.price / acqd.investment) AS uplift
FROM acquiring AS acqn
JOIN acquired AS acqd ON acqn.KEY = acqd.KEY
ORDER BY price DESC, acquisition
LIMIT 10;

'''

In [ ]:
#Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год 
#включительно. Проверьте, что сумма инвестиций не равна нулю. 
#Выведите также номер месяца, в котором проходил раунд финансирования.

'''
WITH 
com AS (SELECT name,
        id
       FROM company AS c
       WHERE category_code = 'social'),
       
fun AS (SELECT company_id,
        EXTRACT(month FROM funded_at) AS m
       FROM funding_round
       WHERE funded_at BETWEEN '01-01-2010' AND '31-12-2013' AND raised_amount <>0)
SELECT com.name,
       fun.m
FROM com JOIN fun ON com.id = fun.company_id
   
'''

In [ ]:
#Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды.
#Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:
#номер месяца, в котором проходили раунды;
#количество уникальных названий фондов из США, которые инвестировали в этом месяце;
#количество компаний, купленных за этот месяц;
#общая сумма сделок по покупкам в этом месяце.


'''
WITH
fun AS (SELECT EXTRACT(MONTH FROM fr.funded_at) AS mo,
       COUNT(DISTINCT f.id) AS us_funds
       FROM fund AS f
       LEFT JOIN investment AS i ON f.id = i.fund_id
       LEFT JOIN funding_round AS fr ON i.funding_round_id = fr.id
       WHERE f.country_code = 'USA' AND EXTRACT(YEAR FROM CAST(fr.funded_at AS DATE)) BETWEEN 2010 AND 2013
GROUP BY mo),

ac AS (SELECT EXTRACT(MONTH FROM CAST(acquired_at AS DATE)) AS funding_month,
       COUNT(acquired_company_id) AS count_ac,
      SUM(price_amount) AS sum_total
       FROM acquisition
      WHERE EXTRACT(YEAR FROM CAST(acquired_at AS DATE)) BETWEEN 2010        AND 2013
      GROUP BY funding_month)

SELECT fun.mo,
       fun.us_funds,
       ac.count_ac,
       ac.sum_total
FROM fun 
JOIN ac ON fun.mo = ac.funding_month;

'''

In [ ]:
#Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 
#2012 и 2013 годах. Данные за каждый год должны быть в отдельном поле. 
#Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

'''
WITH
_2011 AS (SELECT 
         AVG(c.funding_total) AS sum_total_2011,
         c.country_code AS con_name
         FROM company AS c
         WHERE EXTRACT(YEAR FROM CAST(founded_at AS date))= '2011'
         GROUP BY c.country_code),
 
_2012 AS (SELECT 
         AVG(c.funding_total) AS sum_total_2012,
         c.country_code AS con_name
         FROM company AS c
         WHERE EXTRACT(YEAR FROM CAST(founded_at AS date))= '2012'
         GROUP BY c.country_code),

_2013 AS (SELECT 
         AVG(c.funding_total) AS sum_total_2013,
         c.country_code AS con_name
         FROM company AS c
         WHERE EXTRACT(YEAR FROM CAST(founded_at AS date))= '2013'
         GROUP BY c.country_code)
         

SELECT  _2011.con_name,
         _2011.sum_total_2011,
        _2012.sum_total_2012,
       _2013.sum_total_2013
       
FROM _2011 
JOIN _2012 ON _2011.con_name = _2012.con_name
JOIN _2013 ON _2012.con_name = _2013.con_name
ORDER BY _2011.sum_total_2011 DESC

'''